# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.
n = str(input("Введите первую строку: "))
m = str(input("Введите вторую строку: "))
print(n.count(m))